system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 -5 -0.05)
    (15 -5 -0.05)
    (15  5 -0.05)
    (-5  5 -0.05)
    (-5 -5  0.05)
    (15 -5  0.05)
    (15  5  0.05)
    (-5  5  0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    topAndBottom
    {
        type symmetryPlane;
        faces ( (3 7 6 2) (0 1 5 4) );
    }
    frontAndBack
    {
        type empty;
        faces ( (4 5 6 7) (0 3 2 1) );
    }
);